n5/src/Catalogs/AIModels/AIModels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AIModels</name>
  <attributes>
    <name>Inactive</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Provider</name>
    <type>
      <types>EnumRef.AIProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>Tokens</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Enums/AIProviders/AIProviders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AIProviders</name>
  <enumValues>
    <name>OpenAI</name>
  </enumValues>
  <enumValues>
    <name>Anthropic</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/AIModels/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Inactive show filled ( Object.Ref );
	|Tokens show Object.Provider = Enum.AIProviders.Anthropic;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtClient
Procedure ProviderOnChange ( Item )

	applyProvider ();
	
EndProcedure

&AtClient
Procedure applyProvider ()

	if ( Object.Provider <> PredefinedValue ( "Enum.AIProviders.Anthropic" ) ) then
		Object.Tokens = 0;
	endif;
	Appearance.Apply ( ThisObject, "Object.Provider" );

EndProcedure
